# ####################################################################

#  Created by Genus(TM) Synthesis Solution 20.11-s111_1 on Sun Dec 07 21:57:45 IST 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design top

create_clock -name "clk" -period 122.0 -waveform {0.0 61.0} [get_ports clk]
set_clock_transition 0.4 [get_clocks clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_in[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_in[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports clk_enable]
set_input_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports reset]
set_input_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports clk]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {ce_out[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {ce_out[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {ce_out[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {ce_out[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {ce_out[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {ce_out[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {ce_out[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {ce_out[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {ce_out[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {ce_out[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {ce_out[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {ce_out[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {ce_out[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {ce_out[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {ce_out[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {ce_out[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {ce_out[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {ce_out[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {ce_out[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {ce_out[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {ce_out[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {ce_out[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_out[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_out[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_out[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_out[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_out[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_out[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_out[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_out[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_out[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_out[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_out[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_out[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_out[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_out[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_out[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_out[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_out[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_out[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_out[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_out[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_out[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.05 [get_ports {filter_out[21]}]
set_wire_load_mode "top"
set_dont_touch [get_nets u_hb1/n_1519]
set_dont_touch [get_nets u_hb1/n_1520]
set_dont_touch [get_nets u_hb1/n_1521]
set_dont_touch [get_nets u_hb1/n_1522]
set_dont_touch [get_nets u_hb1/n_1523]
set_dont_touch [get_nets u_hb1/n_1524]
set_dont_touch [get_nets u_hb1/n_1525]
set_dont_touch [get_nets u_hb1/n_1526]
set_dont_touch [get_nets u_hb1/n_1527]
set_dont_touch [get_nets u_hb1/n_1528]
set_dont_touch [get_nets u_hb1/n_1529]
set_dont_touch [get_nets u_hb1/n_1530]
set_dont_touch [get_nets u_hb1/n_1531]
set_dont_touch [get_nets u_hb1/n_1532]
set_dont_touch [get_nets u_hb1/n_1533]
set_dont_touch [get_nets u_hb1/n_1534]
set_dont_touch [get_nets u_hb1/n_1535]
set_dont_touch [get_nets u_hb1/n_1536]
set_dont_touch [get_nets u_hb1/n_1537]
set_dont_touch [get_nets u_hb1/n_1538]
set_dont_touch [get_nets u_hb1/n_1539]
set_dont_touch [get_nets u_hb1/n_1540]
set_dont_touch [get_nets u_hb1/n_1541]
set_dont_touch [get_nets u_hb1/n_1542]
set_dont_touch [get_nets u_hb1/n_1543]
set_dont_touch [get_nets u_hb1/n_1544]
set_dont_touch [get_nets u_hb1/n_1545]
set_dont_touch [get_nets u_hb1/n_1546]
set_dont_touch [get_nets u_hb1/n_1547]
set_dont_touch [get_nets u_hb1/n_1548]
set_dont_touch [get_nets u_hb1/n_1549]
set_dont_touch [get_nets u_hb1/n_1561]
set_dont_touch [get_nets u_hb1/n_1562]
set_dont_touch [get_nets u_hb1/n_1563]
set_dont_touch [get_nets u_hb1/n_1564]
set_dont_touch [get_nets u_hb1/n_1565]
set_dont_touch [get_nets u_hb1/n_1566]
set_dont_touch [get_nets u_hb1/n_1567]
set_dont_touch [get_nets u_hb1/n_1568]
set_dont_touch [get_nets u_hb1/n_1569]
set_dont_touch [get_nets u_hb1/n_1570]
set_dont_touch [get_nets u_hb1/n_1571]
set_dont_touch [get_nets u_hb1/n_1572]
set_dont_touch [get_nets u_hb1/n_1573]
set_dont_touch [get_nets u_hb1/n_1574]
set_dont_touch [get_nets u_hb1/n_1575]
set_dont_touch [get_nets u_hb1/n_1576]
set_dont_touch [get_nets u_hb1/n_1577]
set_dont_touch [get_nets u_hb1/n_1578]
set_dont_touch [get_nets u_hb1/n_1579]
set_dont_touch [get_nets u_hb1/n_1580]
set_dont_touch [get_nets u_hb1/n_1581]
set_dont_touch [get_nets u_hb1/n_1582]
set_dont_touch [get_nets u_hb1/n_1583]
set_dont_touch [get_nets u_hb1/n_1584]
set_dont_touch [get_nets u_hb1/n_1585]
set_dont_touch [get_nets u_hb1/n_1586]
set_dont_touch [get_nets u_hb1/n_1587]
set_dont_touch [get_nets u_hb1/n_1588]
set_dont_touch [get_nets u_hb1/n_1589]
set_dont_touch [get_nets u_hb1/n_1590]
set_dont_touch [get_nets u_hb1/n_1591]
set_dont_touch [get_nets u_hb1/n_1603]
set_dont_touch [get_nets u_hb1/n_1604]
set_dont_touch [get_nets u_hb1/n_1605]
set_dont_touch [get_nets u_hb1/n_1606]
set_dont_touch [get_nets u_hb1/n_1607]
set_dont_touch [get_nets u_hb1/n_1608]
set_dont_touch [get_nets u_hb1/n_1609]
set_dont_touch [get_nets u_hb1/n_1610]
set_dont_touch [get_nets u_hb1/n_1611]
set_dont_touch [get_nets u_hb1/n_1612]
set_dont_touch [get_nets u_hb1/n_1613]
set_dont_touch [get_nets u_hb1/n_1614]
set_dont_touch [get_nets u_hb1/n_1615]
set_dont_touch [get_nets u_hb1/n_1616]
set_dont_touch [get_nets u_hb1/n_1617]
set_dont_touch [get_nets u_hb1/n_1618]
set_dont_touch [get_nets u_hb1/n_1619]
set_dont_touch [get_nets u_hb1/n_1620]
set_dont_touch [get_nets u_hb1/n_1621]
set_dont_touch [get_nets u_hb1/n_1622]
set_dont_touch [get_nets u_hb1/n_1623]
set_dont_touch [get_nets u_hb1/n_1624]
set_dont_touch [get_nets u_hb1/n_1625]
set_dont_touch [get_nets u_hb1/n_1626]
set_dont_touch [get_nets u_hb1/n_1627]
set_dont_touch [get_nets u_hb1/n_1628]
set_dont_touch [get_nets u_hb1/n_1629]
set_dont_touch [get_nets u_hb1/n_1630]
set_dont_touch [get_nets u_hb1/n_1631]
set_dont_touch [get_nets u_hb1/n_1632]
set_dont_touch [get_nets u_hb1/n_1633]
set_dont_touch [get_nets u_hb1/n_1634]
set_dont_touch [get_nets u_hb1/n_1635]
set_dont_touch [get_nets u_hb1/n_1636]
set_dont_touch [get_nets u_hb1/n_1637]
set_dont_touch [get_nets u_hb1/n_1638]
set_dont_touch [get_nets u_hb1/n_1644]
set_dont_touch [get_nets u_hb1/n_1645]
set_dont_touch [get_nets u_hb1/n_1646]
set_dont_touch [get_nets u_hb1/n_1647]
set_dont_touch [get_nets u_hb1/n_1648]
set_dont_touch [get_nets u_hb1/n_1649]
set_dont_touch [get_nets u_hb1/n_1650]
set_dont_touch [get_nets u_hb1/n_1651]
set_dont_touch [get_nets u_hb1/n_1652]
set_dont_touch [get_nets u_hb1/n_1653]
set_dont_touch [get_nets u_hb1/n_1654]
set_dont_touch [get_nets u_hb1/n_1655]
set_dont_touch [get_nets u_hb1/n_1656]
set_dont_touch [get_nets u_hb1/n_1657]
set_dont_touch [get_nets u_hb1/n_1658]
set_dont_touch [get_nets u_hb1/n_1659]
set_dont_touch [get_nets u_hb1/n_1660]
set_dont_touch [get_nets u_hb1/n_1661]
set_dont_touch [get_nets u_hb1/n_1662]
set_dont_touch [get_nets u_hb1/n_1663]
set_dont_touch [get_nets u_hb1/n_1664]
set_dont_touch [get_nets u_hb1/n_1665]
set_dont_touch [get_nets u_hb1/n_1666]
set_dont_touch [get_nets u_hb1/n_1667]
set_dont_touch [get_nets u_hb1/n_1668]
set_dont_touch [get_nets u_hb1/n_1669]
set_dont_touch [get_nets u_hb1/n_1670]
set_dont_touch [get_nets u_hb1/n_1671]
set_dont_touch [get_nets u_hb1/n_1672]
set_dont_touch [get_nets u_hb1/n_1673]
set_dont_touch [get_nets u_hb1/n_1674]
set_dont_touch [get_nets u_hb1/n_1675]
set_dont_touch [get_nets u_hb1/n_1676]
set_dont_touch [get_nets u_hb1/n_1677]
set_dont_touch [get_nets u_hb1/n_1678]
set_dont_touch [get_nets u_hb1/n_1679]
set_dont_touch [get_nets u_hb1/n_1680]
set_dont_touch [get_nets u_hb1/n_1681]
set_dont_touch [get_nets u_hb1/n_1682]
set_dont_touch [get_nets u_hb1/n_1683]
set_dont_touch [get_nets u_hb1/n_1684]
set_dont_touch [get_nets u_hb1/n_1685]
set_dont_touch [get_nets u_hb1/n_1686]
set_dont_touch [get_nets u_hb1/n_1687]
set_dont_touch [get_nets u_hb1/n_1688]
set_dont_touch [get_nets u_hb1/n_1689]
set_dont_touch [get_nets u_hb1/n_1690]
set_dont_touch [get_nets u_hb1/n_1691]
set_dont_touch [get_nets u_hb1/n_1692]
set_dont_touch [get_nets u_hb1/n_1693]
set_dont_touch [get_nets u_hb1/n_1694]
set_dont_touch [get_nets u_hb1/n_1695]
set_dont_touch [get_nets u_hb1/n_1696]
set_dont_touch [get_nets u_hb1/n_1697]
set_dont_touch [get_nets u_hb1/n_1698]
set_dont_touch [get_nets u_hb1/n_1699]
set_dont_touch [get_nets u_hb1/n_1700]
set_dont_touch [get_nets u_hb1/n_1701]
set_dont_touch [get_nets u_hb1/n_1702]
set_dont_touch [get_nets u_hb1/n_1703]
set_dont_touch [get_nets u_hb1/n_1704]
set_dont_touch [get_nets u_hb1/n_1705]
set_dont_touch [get_nets u_hb1/n_1706]
set_dont_touch [get_nets u_hb1/n_1707]
set_dont_touch [get_nets u_hb1/n_1708]
set_dont_touch [get_nets u_hb1/n_1709]
set_dont_touch [get_nets u_hb1/n_1710]
set_dont_touch [get_nets u_hb1/n_1711]
set_dont_touch [get_nets u_hb1/n_1712]
set_dont_touch [get_nets u_hb1/n_1713]
set_dont_touch [get_nets u_hb1/n_1714]
set_dont_touch [get_nets u_hb1/n_1715]
set_dont_touch [get_nets u_hb1/n_1716]
set_dont_touch [get_nets u_hb1/n_1717]
set_dont_touch [get_nets u_hb1/n_1718]
set_dont_touch [get_nets u_hb1/n_1719]
set_dont_touch [get_nets u_hb1/n_1720]
set_dont_touch [get_nets u_hb1/n_1723]
set_dont_touch [get_nets u_hb1/n_1724]
set_dont_touch [get_nets u_hb1/n_1725]
set_dont_touch [get_nets u_hb1/n_1726]
set_dont_touch [get_nets u_hb1/n_1727]
set_dont_touch [get_nets u_hb1/n_1728]
set_dont_touch [get_nets u_hb1/n_1729]
set_dont_touch [get_nets u_hb1/n_1730]
set_dont_touch [get_nets u_hb1/n_1731]
set_dont_touch [get_nets u_hb1/n_1732]
set_dont_touch [get_nets u_hb1/n_1733]
set_dont_touch [get_nets u_hb1/n_1734]
set_dont_touch [get_nets u_hb1/n_1735]
set_dont_touch [get_nets u_hb1/n_1736]
set_dont_touch [get_nets u_hb1/n_1737]
set_dont_touch [get_nets u_hb1/n_1738]
set_dont_touch [get_nets u_hb1/n_1739]
set_dont_touch [get_nets u_hb1/n_1740]
set_dont_touch [get_nets u_hb1/n_1741]
set_dont_touch [get_nets u_hb1/n_1742]
set_dont_touch [get_nets u_hb1/n_1743]
set_dont_touch [get_nets u_hb1/n_1744]
set_dont_touch [get_nets u_hb1/n_1745]
set_dont_touch [get_nets u_hb1/n_1746]
set_dont_touch [get_nets u_hb1/n_1747]
set_dont_touch [get_nets u_hb1/n_1748]
set_dont_touch [get_nets u_hb1/n_1749]
set_dont_touch [get_nets u_hb1/n_1750]
set_dont_touch [get_nets u_hb1/n_1751]
set_dont_touch [get_nets u_hb1/n_1752]
set_dont_touch [get_nets u_hb1/n_1753]
set_dont_touch [get_nets u_hb1/n_1754]
set_dont_touch [get_nets u_hb1/n_1755]
set_dont_touch [get_nets u_hb1/n_1756]
set_dont_touch [get_nets u_hb1/n_1757]
set_dont_touch [get_nets u_hb1/n_1758]
set_dont_touch [get_nets u_hb1/n_1759]
set_dont_touch [get_nets u_hb1/n_1760]
set_dont_touch [get_nets u_hb1/n_1761]
set_dont_touch [get_nets u_hb1/n_1762]
set_dont_touch [get_nets u_hb1/n_1763]
set_dont_touch [get_nets u_hb1/n_1764]
set_dont_touch [get_nets u_hb1/n_1765]
set_dont_touch [get_nets u_hb2/n_1935]
set_dont_touch [get_nets u_hb2/n_1936]
set_dont_touch [get_nets u_hb2/n_1937]
set_dont_touch [get_nets u_hb2/n_1938]
set_dont_touch [get_nets u_hb2/n_1939]
set_dont_touch [get_nets u_hb2/n_1940]
set_dont_touch [get_nets u_hb2/n_1941]
set_dont_touch [get_nets u_hb2/n_1942]
set_dont_touch [get_nets u_hb2/n_1943]
set_dont_touch [get_nets u_hb2/n_1944]
set_dont_touch [get_nets u_hb2/n_1945]
set_dont_touch [get_nets u_hb2/n_1946]
set_dont_touch [get_nets u_hb2/n_1947]
set_dont_touch [get_nets u_hb2/n_1948]
set_dont_touch [get_nets u_hb2/n_1949]
set_dont_touch [get_nets u_hb2/n_1950]
set_dont_touch [get_nets u_hb2/n_1951]
set_dont_touch [get_nets u_hb2/n_1952]
set_dont_touch [get_nets u_hb2/n_1953]
set_dont_touch [get_nets u_hb2/n_1954]
set_dont_touch [get_nets u_hb2/n_1955]
set_dont_touch [get_nets u_hb2/n_1956]
set_dont_touch [get_nets u_hb2/n_1957]
set_dont_touch [get_nets u_hb2/n_1958]
set_dont_touch [get_nets u_hb2/n_1959]
set_dont_touch [get_nets u_hb2/n_1960]
set_dont_touch [get_nets u_hb2/n_1961]
set_dont_touch [get_nets u_hb2/n_1962]
set_dont_touch [get_nets u_hb2/n_1963]
set_dont_touch [get_nets u_hb2/n_1964]
set_dont_touch [get_nets u_hb2/n_1979]
set_dont_touch [get_nets u_hb2/n_1980]
set_dont_touch [get_nets u_hb2/n_1981]
set_dont_touch [get_nets u_hb2/n_1982]
set_dont_touch [get_nets u_hb2/n_1983]
set_dont_touch [get_nets u_hb2/n_1984]
set_dont_touch [get_nets u_hb2/n_1985]
set_dont_touch [get_nets u_hb2/n_1986]
set_dont_touch [get_nets u_hb2/n_1987]
set_dont_touch [get_nets u_hb2/n_1988]
set_dont_touch [get_nets u_hb2/n_1989]
set_dont_touch [get_nets u_hb2/n_1990]
set_dont_touch [get_nets u_hb2/n_1991]
set_dont_touch [get_nets u_hb2/n_1992]
set_dont_touch [get_nets u_hb2/n_1993]
set_dont_touch [get_nets u_hb2/n_1994]
set_dont_touch [get_nets u_hb2/n_1995]
set_dont_touch [get_nets u_hb2/n_1996]
set_dont_touch [get_nets u_hb2/n_1997]
set_dont_touch [get_nets u_hb2/n_1998]
set_dont_touch [get_nets u_hb2/n_1999]
set_dont_touch [get_nets u_hb2/n_2000]
set_dont_touch [get_nets u_hb2/n_2001]
set_dont_touch [get_nets u_hb2/n_2002]
set_dont_touch [get_nets u_hb2/n_2003]
set_dont_touch [get_nets u_hb2/n_2004]
set_dont_touch [get_nets u_hb2/n_2005]
set_dont_touch [get_nets u_hb2/n_2006]
set_dont_touch [get_nets u_hb2/n_2007]
set_dont_touch [get_nets u_hb2/n_2023]
set_dont_touch [get_nets u_hb2/n_2024]
set_dont_touch [get_nets u_hb2/n_2025]
set_dont_touch [get_nets u_hb2/n_2026]
set_dont_touch [get_nets u_hb2/n_2027]
set_dont_touch [get_nets u_hb2/n_2028]
set_dont_touch [get_nets u_hb2/n_2029]
set_dont_touch [get_nets u_hb2/n_2030]
set_dont_touch [get_nets u_hb2/n_2031]
set_dont_touch [get_nets u_hb2/n_2032]
set_dont_touch [get_nets u_hb2/n_2033]
set_dont_touch [get_nets u_hb2/n_2034]
set_dont_touch [get_nets u_hb2/n_2035]
set_dont_touch [get_nets u_hb2/n_2036]
set_dont_touch [get_nets u_hb2/n_2037]
set_dont_touch [get_nets u_hb2/n_2038]
set_dont_touch [get_nets u_hb2/n_2039]
set_dont_touch [get_nets u_hb2/n_2040]
set_dont_touch [get_nets u_hb2/n_2041]
set_dont_touch [get_nets u_hb2/n_2042]
set_dont_touch [get_nets u_hb2/n_2043]
set_dont_touch [get_nets u_hb2/n_2044]
set_dont_touch [get_nets u_hb2/n_2045]
set_dont_touch [get_nets u_hb2/n_2046]
set_dont_touch [get_nets u_hb2/n_2047]
set_dont_touch [get_nets u_hb2/n_2048]
set_dont_touch [get_nets u_hb2/n_2049]
set_dont_touch [get_nets u_hb2/n_2050]
set_dont_touch [get_nets u_hb2/n_2051]
set_dont_touch [get_nets u_hb2/n_2052]
set_dont_touch [get_nets u_hb2/n_2053]
set_dont_touch [get_nets u_hb2/n_2054]
set_dont_touch [get_nets u_hb2/n_2066]
set_dont_touch [get_nets u_hb2/n_2067]
set_dont_touch [get_nets u_hb2/n_2068]
set_dont_touch [get_nets u_hb2/n_2069]
set_dont_touch [get_nets u_hb2/n_2070]
set_dont_touch [get_nets u_hb2/n_2071]
set_dont_touch [get_nets u_hb2/n_2072]
set_dont_touch [get_nets u_hb2/n_2073]
set_dont_touch [get_nets u_hb2/n_2074]
set_dont_touch [get_nets u_hb2/n_2075]
set_dont_touch [get_nets u_hb2/n_2076]
set_dont_touch [get_nets u_hb2/n_2077]
set_dont_touch [get_nets u_hb2/n_2078]
set_dont_touch [get_nets u_hb2/n_2079]
set_dont_touch [get_nets u_hb2/n_2080]
set_dont_touch [get_nets u_hb2/n_2081]
set_dont_touch [get_nets u_hb2/n_2082]
set_dont_touch [get_nets u_hb2/n_2083]
set_dont_touch [get_nets u_hb2/n_2084]
set_dont_touch [get_nets u_hb2/n_2085]
set_dont_touch [get_nets u_hb2/n_2086]
set_dont_touch [get_nets u_hb2/n_2087]
set_dont_touch [get_nets u_hb2/n_2088]
set_dont_touch [get_nets u_hb2/n_2089]
set_dont_touch [get_nets u_hb2/n_2090]
set_dont_touch [get_nets u_hb2/n_2091]
set_dont_touch [get_nets u_hb2/n_2092]
set_dont_touch [get_nets u_hb2/n_2093]
set_dont_touch [get_nets u_hb2/n_2094]
set_dont_touch [get_nets u_hb2/n_2095]
set_dont_touch [get_nets u_hb2/n_2096]
set_dont_touch [get_nets u_hb2/n_2097]
set_dont_touch [get_nets u_hb2/n_2098]
set_dont_touch [get_nets u_hb2/n_2099]
set_dont_touch [get_nets u_hb2/n_2104]
set_dont_touch [get_nets u_hb2/n_2105]
set_dont_touch [get_nets u_hb2/n_2106]
set_dont_touch [get_nets u_hb2/n_2107]
set_dont_touch [get_nets u_hb2/n_2108]
set_dont_touch [get_nets u_hb2/n_2109]
set_dont_touch [get_nets u_hb2/n_2110]
set_dont_touch [get_nets u_hb2/n_2111]
set_dont_touch [get_nets u_hb2/n_2112]
set_dont_touch [get_nets u_hb2/n_2113]
set_dont_touch [get_nets u_hb2/n_2114]
set_dont_touch [get_nets u_hb2/n_2115]
set_dont_touch [get_nets u_hb2/n_2116]
set_dont_touch [get_nets u_hb2/n_2117]
set_dont_touch [get_nets u_hb2/n_2118]
set_dont_touch [get_nets u_hb2/n_2119]
set_dont_touch [get_nets u_hb2/n_2120]
set_dont_touch [get_nets u_hb2/n_2121]
set_dont_touch [get_nets u_hb2/n_2122]
set_dont_touch [get_nets u_hb2/n_2123]
set_dont_touch [get_nets u_hb2/n_2124]
set_dont_touch [get_nets u_hb2/n_2125]
set_dont_touch [get_nets u_hb2/n_2126]
set_dont_touch [get_nets u_hb2/n_2127]
set_dont_touch [get_nets u_hb2/n_2128]
set_dont_touch [get_nets u_hb2/n_2129]
set_dont_touch [get_nets u_hb2/n_2130]
set_dont_touch [get_nets u_hb2/n_2131]
set_dont_touch [get_nets u_hb2/n_2132]
set_dont_touch [get_nets u_hb2/n_2133]
set_dont_touch [get_nets u_hb2/n_2134]
set_dont_touch [get_nets u_hb2/n_2135]
set_dont_touch [get_nets u_hb2/n_2136]
set_dont_touch [get_nets u_hb2/n_2137]
set_dont_touch [get_nets u_hb2/n_2138]
set_dont_touch [get_nets u_hb2/n_2139]
set_dont_touch [get_nets u_hb2/n_2140]
set_dont_touch [get_nets u_hb2/n_2141]
set_dont_touch [get_nets u_hb2/n_2142]
set_dont_touch [get_nets u_hb2/n_2143]
set_dont_touch [get_nets u_hb2/n_2144]
set_dont_touch [get_nets u_hb2/n_2145]
set_dont_touch [get_nets u_hb2/n_2146]
set_dont_touch [get_nets u_hb2/n_2147]
set_dont_touch [get_nets u_hb2/n_2148]
set_dont_touch [get_nets u_hb2/n_2149]
set_dont_touch [get_nets u_hb2/n_2150]
set_dont_touch [get_nets u_hb2/n_2151]
set_dont_touch [get_nets u_hb2/n_2152]
set_dont_touch [get_nets u_hb2/n_2153]
set_dont_touch [get_nets u_hb2/n_2154]
set_dont_touch [get_nets u_hb2/n_2155]
set_dont_touch [get_nets u_hb2/n_2156]
set_dont_touch [get_nets u_hb2/n_2157]
set_dont_touch [get_nets u_hb2/n_2158]
set_dont_touch [get_nets u_hb2/n_2159]
set_dont_touch [get_nets u_hb2/n_2160]
set_dont_touch [get_nets u_hb2/n_2161]
set_dont_touch [get_nets u_hb2/n_2162]
set_dont_touch [get_nets u_hb2/n_2163]
set_dont_touch [get_nets u_hb2/n_2164]
set_dont_touch [get_nets u_hb2/n_2165]
set_dont_touch [get_nets u_hb2/n_2166]
set_dont_touch [get_nets u_hb2/n_2167]
set_dont_touch [get_nets u_hb2/n_2168]
set_dont_touch [get_nets u_hb2/n_2169]
set_dont_touch [get_nets u_hb2/n_2170]
set_dont_touch [get_nets u_hb2/n_2171]
set_dont_touch [get_nets u_hb2/n_2172]
set_dont_touch [get_nets u_hb2/n_2173]
set_dont_touch [get_nets u_hb2/n_2174]
set_dont_touch [get_nets u_hb2/n_2175]
set_dont_touch [get_nets u_hb2/n_2176]
set_dont_touch [get_nets u_hb2/n_2177]
set_dont_touch [get_nets u_hb2/n_2178]
set_dont_touch [get_nets u_hb2/n_2179]
set_dont_touch [get_nets u_hb2/n_2180]
set_dont_touch [get_nets u_hb2/n_2181]
set_dont_touch [get_nets u_hb2/n_2182]
set_dont_touch [get_nets u_hb2/n_2183]
set_dont_touch [get_nets u_hb2/n_2184]
set_dont_touch [get_nets u_hb2/n_2185]
set_dont_touch [get_nets u_hb2/n_2186]
set_dont_touch [get_nets u_hb2/n_2187]
set_dont_touch [get_nets u_hb2/n_2188]
set_dont_touch [get_nets u_hb2/n_2189]
set_dont_touch [get_nets u_hb2/n_2190]
set_dont_touch [get_nets u_hb2/n_2191]
set_dont_touch [get_nets u_hb2/n_2192]
set_dont_touch [get_nets u_hb2/n_2193]
set_dont_touch [get_nets u_hb2/n_2194]
set_dont_touch [get_nets u_hb2/n_2195]
set_dont_touch [get_nets u_hb2/n_2196]
set_dont_touch [get_nets u_hb2/n_2197]
set_dont_touch [get_nets u_hb2/n_2198]
set_dont_touch [get_nets u_hb2/n_2199]
set_dont_touch [get_nets u_hb2/n_2200]
set_dont_touch [get_nets u_hb2/n_2201]
set_dont_touch [get_nets u_hb2/n_2202]
set_dont_touch [get_nets u_hb2/n_2203]
set_dont_touch [get_nets u_hb2/n_2204]
set_dont_touch [get_nets u_hb2/n_2205]
set_dont_touch [get_nets u_hb2/n_2206]
set_dont_touch [get_nets u_hb2/n_2207]
set_dont_touch [get_nets u_hb2/n_2208]
set_dont_touch [get_nets u_hb2/n_2209]
set_dont_touch [get_nets u_hb2/n_2210]
set_dont_touch [get_nets u_hb2/n_2211]
set_dont_touch [get_nets u_hb2/n_2212]
set_dont_touch [get_nets u_hb2/n_2213]
set_dont_touch [get_nets u_hb2/n_2214]
set_dont_touch [get_nets u_hb2/n_2215]
set_dont_touch [get_nets u_hb2/n_2216]
set_dont_touch [get_nets u_hb2/n_2217]
set_dont_touch [get_nets u_hb2/n_2218]
set_dont_touch [get_nets u_hb2/n_2219]
set_dont_touch [get_nets u_hb2/n_2220]
set_dont_touch [get_nets u_hb2/n_2221]
set_dont_touch [get_nets u_hb2/n_2222]
set_dont_touch [get_nets u_hb2/n_2223]
set_dont_touch [get_nets u_hb2/n_2224]
set_dont_touch [get_nets u_hb2/n_2225]
set_dont_touch [get_nets u_hb2/n_2226]
set_dont_touch [get_nets u_hb2/n_2227]
set_dont_touch [get_nets u_hb2/n_2228]
set_dont_touch [get_nets u_hb2/n_2229]
set_dont_touch [get_nets u_hb2/n_2230]
set_dont_touch [get_nets u_hb2/n_2231]
set_dont_touch [get_nets u_hb2/n_2232]
set_dont_touch [get_nets u_hb2/n_2233]
set_dont_touch [get_nets u_hb2/n_2234]
set_dont_touch [get_nets u_hb2/n_2236]
set_dont_touch [get_nets u_hb2/n_2237]
set_dont_touch [get_nets u_hb2/n_2238]
set_dont_touch [get_nets u_hb2/n_2239]
set_dont_touch [get_nets u_hb2/n_2240]
set_dont_touch [get_nets u_hb2/n_2241]
set_dont_touch [get_nets u_hb2/n_2242]
set_dont_touch [get_nets u_hb2/n_2243]
set_dont_touch [get_nets u_hb2/n_2244]
set_dont_touch [get_nets u_hb2/n_2245]
set_dont_touch [get_nets u_hb2/n_2246]
set_dont_touch [get_nets u_hb2/n_2247]
set_dont_touch [get_nets u_hb2/n_2248]
set_dont_touch [get_nets u_hb2/n_2249]
set_dont_touch [get_nets u_hb2/n_2250]
set_dont_touch [get_nets u_hb2/n_2251]
set_dont_touch [get_nets u_hb2/n_2252]
set_dont_touch [get_nets u_hb2/n_2253]
set_dont_touch [get_nets u_hb2/n_2254]
set_dont_touch [get_nets u_hb2/n_2255]
set_dont_touch [get_nets u_hb2/n_2256]
set_dont_touch [get_nets u_hb2/n_2257]
set_dont_touch [get_nets u_hb2/n_2258]
set_dont_touch [get_nets u_hb2/n_2259]
set_dont_touch [get_nets u_hb2/n_2260]
set_dont_touch [get_nets u_hb2/n_2261]
set_dont_touch [get_nets u_hb2/n_2262]
set_dont_touch [get_nets u_hb2/n_2263]
set_dont_touch [get_nets u_hb2/n_2264]
set_dont_touch [get_nets u_hb2/n_2265]
set_dont_touch [get_nets u_hb2/n_2266]
set_dont_touch [get_nets u_hb2/n_2267]
set_dont_touch [get_nets u_hb2/n_2268]
set_dont_touch [get_nets u_hb2/n_2269]
set_dont_touch [get_nets u_hb2/n_2270]
set_dont_touch [get_nets u_hb2/n_2271]
set_dont_touch [get_nets u_hb2/n_2272]
set_dont_touch [get_nets u_hb2/n_2273]
set_dont_touch [get_nets u_hb2/n_2274]
set_dont_touch [get_nets u_hb2/n_2275]
set_dont_touch [get_nets u_hb2/n_2276]
set_dont_touch [get_nets u_hb2/n_2277]
set_dont_touch [get_nets u_hb2/n_2278]
set_dont_touch [get_nets u_hb2/n_2279]
set_dont_touch [get_nets u_hb3/n_1817]
set_dont_touch [get_nets u_hb3/n_1818]
set_dont_touch [get_nets u_hb3/n_1819]
set_dont_touch [get_nets u_hb3/n_1820]
set_dont_touch [get_nets u_hb3/n_1821]
set_dont_touch [get_nets u_hb3/n_1822]
set_dont_touch [get_nets u_hb3/n_1823]
set_dont_touch [get_nets u_hb3/n_1824]
set_dont_touch [get_nets u_hb3/n_1825]
set_dont_touch [get_nets u_hb3/n_1826]
set_dont_touch [get_nets u_hb3/n_1827]
set_dont_touch [get_nets u_hb3/n_1828]
set_dont_touch [get_nets u_hb3/n_1829]
set_dont_touch [get_nets u_hb3/n_1830]
set_dont_touch [get_nets u_hb3/n_1831]
set_dont_touch [get_nets u_hb3/n_1832]
set_dont_touch [get_nets u_hb3/n_1833]
set_dont_touch [get_nets u_hb3/n_1834]
set_dont_touch [get_nets u_hb3/n_1835]
set_dont_touch [get_nets u_hb3/n_1836]
set_dont_touch [get_nets u_hb3/n_1837]
set_dont_touch [get_nets u_hb3/n_1838]
set_dont_touch [get_nets u_hb3/n_1839]
set_dont_touch [get_nets u_hb3/n_1840]
set_dont_touch [get_nets u_hb3/n_1841]
set_dont_touch [get_nets u_hb3/n_1842]
set_dont_touch [get_nets u_hb3/n_1843]
set_dont_touch [get_nets u_hb3/n_1863]
set_dont_touch [get_nets u_hb3/n_1864]
set_dont_touch [get_nets u_hb3/n_1865]
set_dont_touch [get_nets u_hb3/n_1866]
set_dont_touch [get_nets u_hb3/n_1867]
set_dont_touch [get_nets u_hb3/n_1868]
set_dont_touch [get_nets u_hb3/n_1869]
set_dont_touch [get_nets u_hb3/n_1870]
set_dont_touch [get_nets u_hb3/n_1871]
set_dont_touch [get_nets u_hb3/n_1872]
set_dont_touch [get_nets u_hb3/n_1873]
set_dont_touch [get_nets u_hb3/n_1874]
set_dont_touch [get_nets u_hb3/n_1875]
set_dont_touch [get_nets u_hb3/n_1876]
set_dont_touch [get_nets u_hb3/n_1877]
set_dont_touch [get_nets u_hb3/n_1878]
set_dont_touch [get_nets u_hb3/n_1879]
set_dont_touch [get_nets u_hb3/n_1880]
set_dont_touch [get_nets u_hb3/n_1881]
set_dont_touch [get_nets u_hb3/n_1882]
set_dont_touch [get_nets u_hb3/n_1883]
set_dont_touch [get_nets u_hb3/n_1884]
set_dont_touch [get_nets u_hb3/n_1885]
set_dont_touch [get_nets u_hb3/n_1886]
set_dont_touch [get_nets u_hb3/n_1887]
set_dont_touch [get_nets u_hb3/n_1888]
set_dont_touch [get_nets u_hb3/n_1889]
set_dont_touch [get_nets u_hb3/n_1890]
set_dont_touch [get_nets u_hb3/n_1891]
set_dont_touch [get_nets u_hb3/n_1908]
set_dont_touch [get_nets u_hb3/n_1909]
set_dont_touch [get_nets u_hb3/n_1910]
set_dont_touch [get_nets u_hb3/n_1911]
set_dont_touch [get_nets u_hb3/n_1912]
set_dont_touch [get_nets u_hb3/n_1913]
set_dont_touch [get_nets u_hb3/n_1914]
set_dont_touch [get_nets u_hb3/n_1915]
set_dont_touch [get_nets u_hb3/n_1916]
set_dont_touch [get_nets u_hb3/n_1917]
set_dont_touch [get_nets u_hb3/n_1918]
set_dont_touch [get_nets u_hb3/n_1919]
set_dont_touch [get_nets u_hb3/n_1920]
set_dont_touch [get_nets u_hb3/n_1921]
set_dont_touch [get_nets u_hb3/n_1922]
set_dont_touch [get_nets u_hb3/n_1923]
set_dont_touch [get_nets u_hb3/n_1924]
set_dont_touch [get_nets u_hb3/n_1925]
set_dont_touch [get_nets u_hb3/n_1926]
set_dont_touch [get_nets u_hb3/n_1927]
set_dont_touch [get_nets u_hb3/n_1928]
set_dont_touch [get_nets u_hb3/n_1929]
set_dont_touch [get_nets u_hb3/n_1930]
set_dont_touch [get_nets u_hb3/n_1931]
set_dont_touch [get_nets u_hb3/n_1932]
set_dont_touch [get_nets u_hb3/n_1933]
set_dont_touch [get_nets u_hb3/n_1934]
set_dont_touch [get_nets u_hb3/n_1935]
set_dont_touch [get_nets u_hb3/n_1936]
set_dont_touch [get_nets u_hb3/n_1937]
set_dont_touch [get_nets u_hb3/n_1938]
set_dont_touch [get_nets u_hb3/n_1939]
set_dont_touch [get_nets u_hb3/n_1940]
set_dont_touch [get_nets u_hb3/n_1955]
set_dont_touch [get_nets u_hb3/n_1956]
set_dont_touch [get_nets u_hb3/n_1957]
set_dont_touch [get_nets u_hb3/n_1958]
set_dont_touch [get_nets u_hb3/n_1959]
set_dont_touch [get_nets u_hb3/n_1960]
set_dont_touch [get_nets u_hb3/n_1961]
set_dont_touch [get_nets u_hb3/n_1962]
set_dont_touch [get_nets u_hb3/n_1963]
set_dont_touch [get_nets u_hb3/n_1964]
set_dont_touch [get_nets u_hb3/n_1965]
set_dont_touch [get_nets u_hb3/n_1966]
set_dont_touch [get_nets u_hb3/n_1967]
set_dont_touch [get_nets u_hb3/n_1968]
set_dont_touch [get_nets u_hb3/n_1969]
set_dont_touch [get_nets u_hb3/n_1970]
set_dont_touch [get_nets u_hb3/n_1971]
set_dont_touch [get_nets u_hb3/n_1972]
set_dont_touch [get_nets u_hb3/n_1973]
set_dont_touch [get_nets u_hb3/n_1974]
set_dont_touch [get_nets u_hb3/n_1975]
set_dont_touch [get_nets u_hb3/n_1976]
set_dont_touch [get_nets u_hb3/n_1977]
set_dont_touch [get_nets u_hb3/n_1978]
set_dont_touch [get_nets u_hb3/n_1979]
set_dont_touch [get_nets u_hb3/n_1980]
set_dont_touch [get_nets u_hb3/n_1981]
set_dont_touch [get_nets u_hb3/n_1982]
set_dont_touch [get_nets u_hb3/n_1983]
set_dont_touch [get_nets u_hb3/n_1984]
set_dont_touch [get_nets u_hb3/n_1985]
set_dont_touch [get_nets u_hb3/n_1986]
set_dont_touch [get_nets u_hb3/n_1992]
set_dont_touch [get_nets u_hb3/n_1993]
set_dont_touch [get_nets u_hb3/n_1994]
set_dont_touch [get_nets u_hb3/n_1995]
set_dont_touch [get_nets u_hb3/n_1996]
set_dont_touch [get_nets u_hb3/n_1997]
set_dont_touch [get_nets u_hb3/n_1998]
set_dont_touch [get_nets u_hb3/n_1999]
set_dont_touch [get_nets u_hb3/n_2000]
set_dont_touch [get_nets u_hb3/n_2001]
set_dont_touch [get_nets u_hb3/n_2002]
set_dont_touch [get_nets u_hb3/n_2003]
set_dont_touch [get_nets u_hb3/n_2004]
set_dont_touch [get_nets u_hb3/n_2005]
set_dont_touch [get_nets u_hb3/n_2006]
set_dont_touch [get_nets u_hb3/n_2007]
set_dont_touch [get_nets u_hb3/n_2008]
set_dont_touch [get_nets u_hb3/n_2009]
set_dont_touch [get_nets u_hb3/n_2010]
set_dont_touch [get_nets u_hb3/n_2011]
set_dont_touch [get_nets u_hb3/n_2012]
set_dont_touch [get_nets u_hb3/n_2013]
set_dont_touch [get_nets u_hb3/n_2014]
set_dont_touch [get_nets u_hb3/n_2015]
set_dont_touch [get_nets u_hb3/n_2016]
set_dont_touch [get_nets u_hb3/n_2017]
set_dont_touch [get_nets u_hb3/n_2018]
set_dont_touch [get_nets u_hb3/n_2019]
set_dont_touch [get_nets u_hb3/n_2020]
set_dont_touch [get_nets u_hb3/n_2021]
set_dont_touch [get_nets u_hb3/n_2022]
set_dont_touch [get_nets u_hb3/n_2023]
set_dont_touch [get_nets u_hb3/n_2024]
set_dont_touch [get_nets u_hb3/n_2025]
set_dont_touch [get_nets u_hb3/n_2026]
set_dont_touch [get_nets u_hb3/n_2027]
set_dont_touch [get_nets u_hb3/n_2028]
set_dont_touch [get_nets u_hb3/n_2029]
set_dont_touch [get_nets u_hb3/n_2030]
set_dont_touch [get_nets u_hb3/n_2031]
set_dont_touch [get_nets u_hb3/n_2032]
set_dont_touch [get_nets u_hb3/n_2033]
set_dont_touch [get_nets u_hb3/n_2034]
set_dont_touch [get_nets u_hb3/n_2035]
set_dont_touch [get_nets u_hb3/n_2036]
set_dont_touch [get_nets u_hb3/n_2037]
set_dont_touch [get_nets u_hb3/n_2038]
set_dont_touch [get_nets u_hb3/n_2039]
set_dont_touch [get_nets u_hb3/n_2040]
set_dont_touch [get_nets u_hb3/n_2041]
set_dont_touch [get_nets u_hb3/n_2042]
set_dont_touch [get_nets u_hb3/n_2043]
set_dont_touch [get_nets u_hb3/n_2044]
set_dont_touch [get_nets u_hb3/n_2045]
set_dont_touch [get_nets u_hb3/n_2046]
set_dont_touch [get_nets u_hb3/n_2047]
set_dont_touch [get_nets u_hb3/n_2048]
set_dont_touch [get_nets u_hb3/n_2049]
set_dont_touch [get_nets u_hb3/n_2050]
set_dont_touch [get_nets u_hb3/n_2051]
set_dont_touch [get_nets u_hb3/n_2052]
set_dont_touch [get_nets u_hb3/n_2053]
set_dont_touch [get_nets u_hb3/n_2054]
set_dont_touch [get_nets u_hb3/n_2055]
set_dont_touch [get_nets u_hb3/n_2056]
set_dont_touch [get_nets u_hb3/n_2057]
set_dont_touch [get_nets u_hb3/n_2058]
set_dont_touch [get_nets u_hb3/n_2059]
set_dont_touch [get_nets u_hb3/n_2060]
set_dont_touch [get_nets u_hb3/n_2061]
set_dont_touch [get_nets u_hb3/n_2062]
set_dont_touch [get_nets u_hb3/n_2063]
set_dont_touch [get_nets u_hb3/n_2064]
set_dont_touch [get_nets u_hb3/n_2065]
set_dont_touch [get_nets u_hb3/n_2066]
set_dont_touch [get_nets u_hb3/n_2067]
set_dont_touch [get_nets u_hb3/n_2068]
set_dont_touch [get_nets u_hb3/n_2069]
set_dont_touch [get_nets u_hb3/n_2070]
set_dont_touch [get_nets u_hb3/n_2071]
set_dont_touch [get_nets u_hb3/n_2072]
set_dont_touch [get_nets u_hb3/n_2073]
set_dont_touch [get_nets u_hb3/n_2074]
set_dont_touch [get_nets u_hb3/n_2075]
set_dont_touch [get_nets u_hb3/n_2076]
set_dont_touch [get_nets u_hb3/n_2077]
set_dont_touch [get_nets u_hb3/n_2078]
set_dont_touch [get_nets u_hb3/n_2079]
set_dont_touch [get_nets u_hb3/n_2080]
set_dont_touch [get_nets u_hb3/n_2081]
set_dont_touch [get_nets u_hb3/n_2082]
set_dont_touch [get_nets u_hb3/n_2083]
